SoCXin/ESP32C3/examples/pikapython/components/PikaPython/pikascript-api/__pikaBinding.c
/*
 * [Warning!] This file is auto-generated by pika compiler.
 * Do not edit it manually.
 * The source code is *.pyi file.
 * More details: 
 * English Doc:
 * https://pikadoc.readthedocs.io/en/latest/PikaScript%20%E6%A8%A1%E5%9D%97%E6%A6%82%E8%BF%B0.html
 * Chinese Doc:
 * https://pikadoc.readthedocs.io/zh/latest/PikaScript%20%E6%A8%A1%E5%9D%97%E6%A6%82%E8%BF%B0.html
 */

#include <stdio.h>
#include <stdlib.h>
#include "BaseObj.h"
#include "ESP32.h"
#include "TinyObj.h"
#include "PikaDebug.h"
#include "TinyObj.h"
#include "PikaDebug_Debuger.h"
#include "TinyObj.h"
#include "PikaMain.h"
#include "PikaStdLib_SysObj.h"
#include "PikaStdDevice.h"
#include "PikaStdLib.h"
#include "_time.h"
#include "PikaStdData.h"
#include "TinyObj.h"
#include "PikaStdData_ByteArray.h"
#include "TinyObj.h"
#include "PikaStdData_Dict.h"
#include "TinyObj.h"
#include "PikaStdData_FILEIO.h"
#include "TinyObj.h"
#include "PikaStdData_List.h"
#include "PikaStdData_Tuple.h"
#include "PikaStdData_String.h"
#include "TinyObj.h"
#include "PikaStdData_Tuple.h"
#include "TinyObj.h"
#include "PikaStdData_Utils.h"
#include "TinyObj.h"
#include "PikaStdData_dict_items.h"
#include "TinyObj.h"
#include "PikaStdData_dict_keys.h"
#include "TinyObj.h"
#include "PikaStdDevice.h"
#include "TinyObj.h"
#include "PikaStdDevice_ADC.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_BaseDev.h"
#include "TinyObj.h"
#include "PikaStdDevice_CAN.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_DAC.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_GPIO.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_IIC.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_PWM.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_SPI.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_UART.h"
#include "TinyObj.h"
#include "PikaStdLib.h"
#include "TinyObj.h"
#include "PikaStdLib_MemChecker.h"
#include "TinyObj.h"
#include "PikaStdLib_RangeObj.h"
#include "TinyObj.h"
#include "PikaStdLib_StringObj.h"
#include "TinyObj.h"
#include "PikaStdLib_SysObj.h"
#include "TinyObj.h"
#include "PikaStdTask.h"
#include "TinyObj.h"
#include "PikaStdTask_Task.h"
#include "PikaStdLib_SysObj.h"
#include "PikaStdData_List.h"
#include "_time.h"
#include "TinyObj.h"

#ifndef PIKA_MODULE_ESP32_DISABLE
class_def(ESP32){
    __BEFORE_MOETHOD_DEF
};
class_inhert(ESP32, TinyObj);

PikaObj *New_ESP32(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, ESP32);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKADEBUG_DISABLE
void PikaDebug_DebugerMethod(PikaObj *self, Args *args){
    Arg* res = PikaDebug_Debuger(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaDebug_Debuger,
    "Debuger", ""
);

class_def(PikaDebug){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaDebug_Debuger, 1761613187),
};
class_inhert(PikaDebug, TinyObj);

PikaObj *New_PikaDebug(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaDebug);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKADEBUG_DISABLE
void PikaDebug_Debuger___init__Method(PikaObj *self, Args *args){
    PikaDebug_Debuger___init__(self);
}
method_typedef(
    PikaDebug_Debuger___init__,
    "__init__", ""
);

void PikaDebug_Debuger_set_traceMethod(PikaObj *self, Args *args){
    PikaDebug_Debuger_set_trace(self);
}
method_typedef(
    PikaDebug_Debuger_set_trace,
    "set_trace", ""
);

class_def(PikaDebug_Debuger){
    __BEFORE_MOETHOD_DEF
    method_def(PikaDebug_Debuger___init__, 904762485),
    method_def(PikaDebug_Debuger_set_trace, 1131228543),
};
class_inhert(PikaDebug_Debuger, TinyObj);

PikaObj *New_PikaDebug_Debuger(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaDebug_Debuger);
    return self;
}

Arg *PikaDebug_Debuger(PikaObj *self){
    return obj_newObjInPackage(New_PikaDebug_Debuger);
}
#endif

#ifndef PIKA_MODULE_MAIN_DISABLE
class_def(PikaMain){
    __BEFORE_MOETHOD_DEF
};
class_inhert(PikaMain, PikaStdLib_SysObj);

PikaObj *New_PikaMain(Args *args){
    PikaObj *self = New_PikaStdLib_SysObj(args);
    obj_newObj(self, "PikaStdDevice", "PikaStdDevice", New_PikaStdDevice);
    obj_newObj(self, "PikaStdLib", "PikaStdLib", New_PikaStdLib);
    obj_newObj(self, "_time", "_time", New__time);
    obj_setClass(self, PikaMain);
    return self;
}

Arg *PikaMain(PikaObj *self){
    return obj_newObjInPackage(New_PikaMain);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_ByteArrayMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_ByteArray(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_ByteArray,
    "ByteArray", ""
);

void PikaStdData_DictMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Dict(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict,
    "Dict", ""
);

void PikaStdData_FILEIOMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_FILEIO(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_FILEIO,
    "FILEIO", ""
);

void PikaStdData_ListMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_List(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_List,
    "List", ""
);

void PikaStdData_StringMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_String(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_String,
    "String", ""
);

void PikaStdData_TupleMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Tuple(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple,
    "Tuple", ""
);

void PikaStdData_UtilsMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Utils(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Utils,
    "Utils", ""
);

void PikaStdData_dict_itemsMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_items(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_items,
    "dict_items", ""
);

void PikaStdData_dict_keysMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_keys(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_keys,
    "dict_keys", ""
);

class_def(PikaStdData){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdData_Tuple, 238099855),
    constructor_def(PikaStdData_Utils, 239242230),
    constructor_def(PikaStdData_FILEIO, 813431197),
    constructor_def(PikaStdData_dict_keys, 872966404),
    constructor_def(PikaStdData_dict_items, 888749258),
    constructor_def(PikaStdData_String, 1374591964),
    constructor_def(PikaStdData_ByteArray, 1998882840),
    constructor_def(PikaStdData_Dict, 2089035049),
    constructor_def(PikaStdData_List, 2089323073),
};
class_inhert(PikaStdData, TinyObj);

