SoCXin/ESP32C3/examples/pikapython/components/PikaPython/pikascript-api/__pikaBinding.c
class_inhert(PikaStdData_String, TinyObj);

PikaObj *New_PikaStdData_String(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_String);
    return self;
}

Arg *PikaStdData_String(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_String);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_Tuple___contains__Method(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    int res = PikaStdData_Tuple___contains__(self, val);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Tuple___contains__,
    "__contains__", "val"
);

void PikaStdData_Tuple___del__Method(PikaObj *self, Args *args){
    PikaStdData_Tuple___del__(self);
}
method_typedef(
    PikaStdData_Tuple___del__,
    "__del__", ""
);

void PikaStdData_Tuple___getitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* res = PikaStdData_Tuple___getitem__(self, __key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple___getitem__,
    "__getitem__", "__key"
);

void PikaStdData_Tuple___init__Method(PikaObj *self, Args *args){
    PikaStdData_Tuple___init__(self);
}
method_typedef(
    PikaStdData_Tuple___init__,
    "__init__", ""
);

void PikaStdData_Tuple___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Tuple___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple___iter__,
    "__iter__", ""
);

void PikaStdData_Tuple___len__Method(PikaObj *self, Args *args){
    int res = PikaStdData_Tuple___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Tuple___len__,
    "__len__", ""
);

void PikaStdData_Tuple___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Tuple___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple___next__,
    "__next__", ""
);

void PikaStdData_Tuple___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_Tuple___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_Tuple___str__,
    "__str__", ""
);

void PikaStdData_Tuple_getMethod(PikaObj *self, Args *args){
    int i = args_getInt(args, "i");
    Arg* res = PikaStdData_Tuple_get(self, i);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple_get,
    "get", "i"
);

void PikaStdData_Tuple_lenMethod(PikaObj *self, Args *args){
    int res = PikaStdData_Tuple_len(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Tuple_len,
    "len", ""
);

class_def(PikaStdData_Tuple){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_Tuple_get, 193492613),
    method_def(PikaStdData_Tuple_len, 193498052),
    method_def(PikaStdData_Tuple___init__, 904762485),
    method_def(PikaStdData_Tuple___iter__, 911732085),
    method_def(PikaStdData_Tuple___next__, 1090305216),
    method_def(PikaStdData_Tuple___getitem__, 1535436016),
    method_def(PikaStdData_Tuple___contains__, 1644201824),
    method_def(PikaStdData_Tuple___del__, 2038499702),
    method_def(PikaStdData_Tuple___len__, 2047989248),
    method_def(PikaStdData_Tuple___str__, 2056834106),
};
class_inhert(PikaStdData_Tuple, TinyObj);

PikaObj *New_PikaStdData_Tuple(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_Tuple);
    return self;
}

Arg *PikaStdData_Tuple(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_Tuple);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_Utils_int_to_bytesMethod(PikaObj *self, Args *args){
    int val = args_getInt(args, "val");
    Arg* res = PikaStdData_Utils_int_to_bytes(self, val);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Utils_int_to_bytes,
    "int_to_bytes", "val"
);

class_def(PikaStdData_Utils){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_Utils_int_to_bytes, 476200216),
};
class_inhert(PikaStdData_Utils, TinyObj);

PikaObj *New_PikaStdData_Utils(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_Utils);
    return self;
}

Arg *PikaStdData_Utils(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_Utils);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_dict_items___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_items___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_items___iter__,
    "__iter__", ""
);

void PikaStdData_dict_items___len__Method(PikaObj *self, Args *args){
    int res = PikaStdData_dict_items___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_dict_items___len__,
    "__len__", ""
);

void PikaStdData_dict_items___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_items___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_items___next__,
    "__next__", ""
);

void PikaStdData_dict_items___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_dict_items___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_dict_items___str__,
    "__str__", ""
);

class_def(PikaStdData_dict_items){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_dict_items___iter__, 911732085),
    method_def(PikaStdData_dict_items___next__, 1090305216),
    method_def(PikaStdData_dict_items___len__, 2047989248),
    method_def(PikaStdData_dict_items___str__, 2056834106),
};
class_inhert(PikaStdData_dict_items, TinyObj);

PikaObj *New_PikaStdData_dict_items(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_dict_items);
    return self;
}

Arg *PikaStdData_dict_items(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_dict_items);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_dict_keys___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_keys___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_keys___iter__,
    "__iter__", ""
);

void PikaStdData_dict_keys___len__Method(PikaObj *self, Args *args){
    int res = PikaStdData_dict_keys___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_dict_keys___len__,
    "__len__", ""
);

