SoCXin/ESP32C3/examples/pikapython/components/PikaPython/pikascript-api/__pikaBinding.c
#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_BaseDev_addEventCallBackMethod(PikaObj *self, Args *args){
    Arg* eventCallback = args_getArg(args, "eventCallback");
    PikaStdDevice_BaseDev_addEventCallBack(self, eventCallback);
}
method_typedef(
    PikaStdDevice_BaseDev_addEventCallBack,
    "addEventCallBack", "eventCallback"
);

void PikaStdDevice_BaseDev_platformGetEventIdMethod(PikaObj *self, Args *args){
    PikaStdDevice_BaseDev_platformGetEventId(self);
}
method_typedef(
    PikaStdDevice_BaseDev_platformGetEventId,
    "platformGetEventId", ""
);

class_def(PikaStdDevice_BaseDev){
    __BEFORE_MOETHOD_DEF
#if PIKA_EVENT_ENABLE
    method_def(PikaStdDevice_BaseDev_platformGetEventId, 794288473),
#endif
#if PIKA_EVENT_ENABLE
    method_def(PikaStdDevice_BaseDev_addEventCallBack, 1710815869),
#endif
};
class_inhert(PikaStdDevice_BaseDev, TinyObj);

PikaObj *New_PikaStdDevice_BaseDev(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdDevice_BaseDev);
    return self;
}

Arg *PikaStdDevice_BaseDev(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_BaseDev);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_CAN___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_CAN___init__(self);
}
method_typedef(
    PikaStdDevice_CAN___init__,
    "__init__", ""
);

void PikaStdDevice_CAN_addFilterMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    int ide = args_getInt(args, "ide");
    int rtr = args_getInt(args, "rtr");
    int mode = args_getInt(args, "mode");
    int mask = args_getInt(args, "mask");
    int hdr = args_getInt(args, "hdr");
    PikaStdDevice_CAN_addFilter(self, id, ide, rtr, mode, mask, hdr);
}
method_typedef(
    PikaStdDevice_CAN_addFilter,
    "addFilter", "id,ide,rtr,mode,mask,hdr"
);

void PikaStdDevice_CAN_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_disable(self);
}
method_typedef(
    PikaStdDevice_CAN_disable,
    "disable", ""
);

void PikaStdDevice_CAN_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_enable(self);
}
method_typedef(
    PikaStdDevice_CAN_enable,
    "enable", ""
);

void PikaStdDevice_CAN_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformDisable(self);
}
method_typedef(
    PikaStdDevice_CAN_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_CAN_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformEnable(self);
}
method_typedef(
    PikaStdDevice_CAN_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_CAN_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformRead(self);
}
method_typedef(
    PikaStdDevice_CAN_platformRead,
    "platformRead", ""
);

void PikaStdDevice_CAN_platformReadBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformReadBytes(self);
}
method_typedef(
    PikaStdDevice_CAN_platformReadBytes,
    "platformReadBytes", ""
);

void PikaStdDevice_CAN_platformWriteMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformWrite(self);
}
method_typedef(
    PikaStdDevice_CAN_platformWrite,
    "platformWrite", ""
);

void PikaStdDevice_CAN_platformWriteBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformWriteBytes(self);
}
method_typedef(
    PikaStdDevice_CAN_platformWriteBytes,
    "platformWriteBytes", ""
);

void PikaStdDevice_CAN_readMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    char* res = PikaStdDevice_CAN_read(self, length);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_CAN_read,
    "read", "length"
);

void PikaStdDevice_CAN_readBytesMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    Arg* res = PikaStdDevice_CAN_readBytes(self, length);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_CAN_readBytes,
    "readBytes", "length"
);

void PikaStdDevice_CAN_setBaudRateMethod(PikaObj *self, Args *args){
    int baudRate = args_getInt(args, "baudRate");
    PikaStdDevice_CAN_setBaudRate(self, baudRate);
}
method_typedef(
    PikaStdDevice_CAN_setBaudRate,
    "setBaudRate", "baudRate"
);

void PikaStdDevice_CAN_setIdMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    PikaStdDevice_CAN_setId(self, id);
}
method_typedef(
    PikaStdDevice_CAN_setId,
    "setId", "id"
);

void PikaStdDevice_CAN_setModeMethod(PikaObj *self, Args *args){
    char* mode = args_getStr(args, "mode");
    PikaStdDevice_CAN_setMode(self, mode);
}
method_typedef(
    PikaStdDevice_CAN_setMode,
    "setMode", "mode"
);

void PikaStdDevice_CAN_setNameMethod(PikaObj *self, Args *args){
    char* name = args_getStr(args, "name");
    PikaStdDevice_CAN_setName(self, name);
}
method_typedef(
    PikaStdDevice_CAN_setName,
    "setName", "name"
);

void PikaStdDevice_CAN_writeMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    PikaStdDevice_CAN_write(self, data);
}
method_typedef(
    PikaStdDevice_CAN_write,
    "write", "data"
);

void PikaStdDevice_CAN_writeBytesMethod(PikaObj *self, Args *args){
    uint8_t* data = args_getBytes(args, "data");
    int length = args_getInt(args, "length");
    PikaStdDevice_CAN_writeBytes(self, data, length);
}
method_typedef(
    PikaStdDevice_CAN_writeBytes,
    "writeBytes", "data,length"
);

class_def(PikaStdDevice_CAN){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_CAN_setMode, 203499702),
    method_def(PikaStdDevice_CAN_setName, 203520690),
    method_def(PikaStdDevice_CAN_setId, 274291614),
    method_def(PikaStdDevice_CAN_write, 279491920),
    method_def(PikaStdDevice_CAN_disable, 314893497),
    method_def(PikaStdDevice_CAN_platformDisable, 326843198),
    method_def(PikaStdDevice_CAN_addFilter, 464296980),
    method_def(PikaStdDevice_CAN_readBytes, 545481704),
    method_def(PikaStdDevice_CAN_platformReadBytes, 673804205),
    method_def(PikaStdDevice_CAN_platformWriteBytes, 726970812),
    method_def(PikaStdDevice_CAN_writeBytes, 787295575),
    method_def(PikaStdDevice_CAN_platformEnable, 835227025),
    method_def(PikaStdDevice_CAN___init__, 904762485),
    method_def(PikaStdDevice_CAN_platformWrite, 1348314773),
    method_def(PikaStdDevice_CAN_setBaudRate, 1620269241),
    method_def(PikaStdDevice_CAN_platformRead, 1797695974),
    method_def(PikaStdDevice_CAN_enable, 2071294892),
    method_def(PikaStdDevice_CAN_read, 2090683713),
};
class_inhert(PikaStdDevice_CAN, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_CAN(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_CAN);
    return self;
}

Arg *PikaStdDevice_CAN(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_CAN);
}
#endif

