SoCXin/ESP32C3/examples/pikapython/components/PikaPython/pikascript-api/__pikaBinding.c
void PikaStdDevice_SPI_setPinMISOMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_SPI_setPinMISO(self, pin);
}
method_typedef(
    PikaStdDevice_SPI_setPinMISO,
    "setPinMISO", "pin"
);

void PikaStdDevice_SPI_setPinMOSIMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_SPI_setPinMOSI(self, pin);
}
method_typedef(
    PikaStdDevice_SPI_setPinMOSI,
    "setPinMOSI", "pin"
);

void PikaStdDevice_SPI_setPinSCKMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_SPI_setPinSCK(self, pin);
}
method_typedef(
    PikaStdDevice_SPI_setPinSCK,
    "setPinSCK", "pin"
);

void PikaStdDevice_SPI_setPolarityMethod(PikaObj *self, Args *args){
    int polarity = args_getInt(args, "polarity");
    PikaStdDevice_SPI_setPolarity(self, polarity);
}
method_typedef(
    PikaStdDevice_SPI_setPolarity,
    "setPolarity", "polarity"
);

void PikaStdDevice_SPI_writeMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    PikaStdDevice_SPI_write(self, data);
}
method_typedef(
    PikaStdDevice_SPI_write,
    "write", "data"
);

void PikaStdDevice_SPI_writeBytesMethod(PikaObj *self, Args *args){
    uint8_t* data = args_getBytes(args, "data");
    int length = args_getInt(args, "length");
    PikaStdDevice_SPI_writeBytes(self, data, length);
}
method_typedef(
    PikaStdDevice_SPI_writeBytes,
    "writeBytes", "data,length"
);

class_def(PikaStdDevice_SPI){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_SPI_setName, 203520690),
    method_def(PikaStdDevice_SPI_setId, 274291614),
    method_def(PikaStdDevice_SPI_setPhase, 276342722),
    method_def(PikaStdDevice_SPI_write, 279491920),
    method_def(PikaStdDevice_SPI_disable, 314893497),
    method_def(PikaStdDevice_SPI_platformDisable, 326843198),
    method_def(PikaStdDevice_SPI_setPinMISO, 342672624),
    method_def(PikaStdDevice_SPI_setPinMOSI, 342679152),
    method_def(PikaStdDevice_SPI_setPinSCK, 530992441),
    method_def(PikaStdDevice_SPI_readBytes, 545481704),
    method_def(PikaStdDevice_SPI_platformReadBytes, 673804205),
    method_def(PikaStdDevice_SPI_platformWriteBytes, 726970812),
    method_def(PikaStdDevice_SPI_writeBytes, 787295575),
    method_def(PikaStdDevice_SPI_platformEnable, 835227025),
    method_def(PikaStdDevice_SPI___init__, 904762485),
    method_def(PikaStdDevice_SPI_platformWrite, 1348314773),
    method_def(PikaStdDevice_SPI_setBaudRate, 1620269241),
    method_def(PikaStdDevice_SPI_platformRead, 1797695974),
    method_def(PikaStdDevice_SPI_setPolarity, 1824081573),
    method_def(PikaStdDevice_SPI_enable, 2071294892),
    method_def(PikaStdDevice_SPI_read, 2090683713),
};
class_inhert(PikaStdDevice_SPI, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_SPI(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_SPI);
    return self;
}

Arg *PikaStdDevice_SPI(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_SPI);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_UART___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_UART___init__(self);
}
method_typedef(
    PikaStdDevice_UART___init__,
    "__init__", ""
);

void PikaStdDevice_UART_closeMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_close(self);
}
method_typedef(
    PikaStdDevice_UART_close,
    "close", ""
);

void PikaStdDevice_UART_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_disable(self);
}
method_typedef(
    PikaStdDevice_UART_disable,
    "disable", ""
);

void PikaStdDevice_UART_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_enable(self);
}
method_typedef(
    PikaStdDevice_UART_enable,
    "enable", ""
);

void PikaStdDevice_UART_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformDisable(self);
}
method_typedef(
    PikaStdDevice_UART_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_UART_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformEnable(self);
}
method_typedef(
    PikaStdDevice_UART_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_UART_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformRead(self);
}
method_typedef(
    PikaStdDevice_UART_platformRead,
    "platformRead", ""
);

void PikaStdDevice_UART_platformReadBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformReadBytes(self);
}
method_typedef(
    PikaStdDevice_UART_platformReadBytes,
    "platformReadBytes", ""
);

void PikaStdDevice_UART_platformWriteMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformWrite(self);
}
method_typedef(
    PikaStdDevice_UART_platformWrite,
    "platformWrite", ""
);

void PikaStdDevice_UART_platformWriteBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformWriteBytes(self);
}
method_typedef(
    PikaStdDevice_UART_platformWriteBytes,
    "platformWriteBytes", ""
);

void PikaStdDevice_UART_readMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    char* res = PikaStdDevice_UART_read(self, length);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_UART_read,
    "read", "length"
);

void PikaStdDevice_UART_readBytesMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    Arg* res = PikaStdDevice_UART_readBytes(self, length);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_UART_readBytes,
    "readBytes", "length"
);

void PikaStdDevice_UART_setBaudRateMethod(PikaObj *self, Args *args){
    int baudRate = args_getInt(args, "baudRate");
    PikaStdDevice_UART_setBaudRate(self, baudRate);
}
method_typedef(
    PikaStdDevice_UART_setBaudRate,
    "setBaudRate", "baudRate"
);

void PikaStdDevice_UART_setCallBackMethod(PikaObj *self, Args *args){
    Arg* eventCallBack = args_getArg(args, "eventCallBack");
    int filter = args_getInt(args, "filter");
    PikaStdDevice_UART_setCallBack(self, eventCallBack, filter);
}
method_typedef(
    PikaStdDevice_UART_setCallBack,
    "setCallBack", "eventCallBack,filter"
);

