SoCXin/ESP32C3/examples/pikapython/components/PikaPython/pikascript-api/__pikaBinding.c
void PikaStdDevice_UART_setFlowControlMethod(PikaObj *self, Args *args){
    int flowControl = args_getInt(args, "flowControl");
    PikaStdDevice_UART_setFlowControl(self, flowControl);
}
method_typedef(
    PikaStdDevice_UART_setFlowControl,
    "setFlowControl", "flowControl"
);

void PikaStdDevice_UART_setIdMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    PikaStdDevice_UART_setId(self, id);
}
method_typedef(
    PikaStdDevice_UART_setId,
    "setId", "id"
);

void PikaStdDevice_UART_setPinCTSMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_UART_setPinCTS(self, pin);
}
method_typedef(
    PikaStdDevice_UART_setPinCTS,
    "setPinCTS", "pin"
);

void PikaStdDevice_UART_setPinRTSMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_UART_setPinRTS(self, pin);
}
method_typedef(
    PikaStdDevice_UART_setPinRTS,
    "setPinRTS", "pin"
);

void PikaStdDevice_UART_setPinRXMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_UART_setPinRX(self, pin);
}
method_typedef(
    PikaStdDevice_UART_setPinRX,
    "setPinRX", "pin"
);

void PikaStdDevice_UART_setPinTXMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_UART_setPinTX(self, pin);
}
method_typedef(
    PikaStdDevice_UART_setPinTX,
    "setPinTX", "pin"
);

void PikaStdDevice_UART_writeMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    PikaStdDevice_UART_write(self, data);
}
method_typedef(
    PikaStdDevice_UART_write,
    "write", "data"
);

void PikaStdDevice_UART_writeBytesMethod(PikaObj *self, Args *args){
    uint8_t* data = args_getBytes(args, "data");
    int length = args_getInt(args, "length");
    PikaStdDevice_UART_writeBytes(self, data, length);
}
method_typedef(
    PikaStdDevice_UART_writeBytes,
    "writeBytes", "data,length"
);

class_def(PikaStdDevice_UART){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_UART_close, 255564379),
    method_def(PikaStdDevice_UART_setId, 274291614),
    method_def(PikaStdDevice_UART_setPinRX, 276391714),
    method_def(PikaStdDevice_UART_setPinTX, 276391780),
    method_def(PikaStdDevice_UART_write, 279491920),
    method_def(PikaStdDevice_UART_disable, 314893497),
    method_def(PikaStdDevice_UART_platformDisable, 326843198),
    method_def(PikaStdDevice_UART_setPinCTS, 530975586),
    method_def(PikaStdDevice_UART_setPinRTS, 530991921),
    method_def(PikaStdDevice_UART_readBytes, 545481704),
    method_def(PikaStdDevice_UART_platformReadBytes, 673804205),
    method_def(PikaStdDevice_UART_platformWriteBytes, 726970812),
    method_def(PikaStdDevice_UART_writeBytes, 787295575),
    method_def(PikaStdDevice_UART_platformEnable, 835227025),
    method_def(PikaStdDevice_UART___init__, 904762485),
    method_def(PikaStdDevice_UART_setCallBack, 945732542),
    method_def(PikaStdDevice_UART_platformWrite, 1348314773),
    method_def(PikaStdDevice_UART_setFlowControl, 1507149322),
    method_def(PikaStdDevice_UART_setBaudRate, 1620269241),
    method_def(PikaStdDevice_UART_platformRead, 1797695974),
    method_def(PikaStdDevice_UART_enable, 2071294892),
    method_def(PikaStdDevice_UART_read, 2090683713),
};
class_inhert(PikaStdDevice_UART, TinyObj);

PikaObj *New_PikaStdDevice_UART(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdDevice_UART);
    return self;
}

Arg *PikaStdDevice_UART(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_UART);
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_MemCheckerMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_MemChecker(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_MemChecker,
    "MemChecker", ""
);

void PikaStdLib_RangeObjMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_RangeObj(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_RangeObj,
    "RangeObj", ""
);

void PikaStdLib_StringObjMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_StringObj(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_StringObj,
    "StringObj", ""
);

void PikaStdLib_SysObjMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_SysObj(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj,
    "SysObj", ""
);

class_def(PikaStdLib){
    __BEFORE_MOETHOD_DEF
#if 0
    constructor_def(PikaStdLib_StringObj, 145144695),
#endif
    constructor_def(PikaStdLib_MemChecker, 426635353),
    constructor_def(PikaStdLib_SysObj, 1380528799),
#if 0
    constructor_def(PikaStdLib_RangeObj, 1538428845),
#endif
};
class_inhert(PikaStdLib, TinyObj);

PikaObj *New_PikaStdLib(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_MemChecker_getMaxMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdLib_MemChecker_getMax(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdLib_MemChecker_getMax,
    "getMax", ""
);

void PikaStdLib_MemChecker_getNowMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdLib_MemChecker_getNow(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdLib_MemChecker_getNow,
    "getNow", ""
);

void PikaStdLib_MemChecker_maxMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_max(self);
}
method_typedef(
    PikaStdLib_MemChecker_max,
    "max", ""
);

void PikaStdLib_MemChecker_nowMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_now(self);
}
method_typedef(
    PikaStdLib_MemChecker_now,
    "now", ""
);

void PikaStdLib_MemChecker_resetMaxMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_resetMax(self);
}
method_typedef(
    PikaStdLib_MemChecker_resetMax,
    "resetMax", ""
);

class_def(PikaStdLib_MemChecker){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdLib_MemChecker_max, 193499019),
    method_def(PikaStdLib_MemChecker_now, 193500569),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_resetMax, 593750542),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_getMax, 2139551979),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_getNow, 2139553529),
#endif
};
class_inhert(PikaStdLib_MemChecker, TinyObj);

PikaObj *New_PikaStdLib_MemChecker(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_MemChecker);
    return self;
}

